Tekla Open API Reference for Tekla Structures 2025
GridSurface Constructor
 Creates a new grid surface instance.
The default values are as follows:
Label = "Default";
IsMagnetic = false;
ExtensionLeft = 2000.0;
ExtensionRight = 2000.0;
ExtensionBelow = 2000.0;
ExtensionAbove = 2000.0;
DrawingVisibility = false;
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public GridSurface()
Public Sub New
See Also
Reference
GridSurface Class
GridSurface Overload
Tekla.Structures.Model Namespace